app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(params[:photo])
    @photo.cube_id = params[:cube_id]
    @photo.image = File.new(upload_path)
    @photo.save
---
INSERT INTO "photos" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    @photos = Photo.all
---
SELECT "photos".* FROM "photos"